---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableToTransformElementError
source: html/472b200d-d8e8-7568-c009-2bf73d00b49d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableToTransformElementError Property

Attempted an invalid element rotate, mirror, or move.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToTransformElementError { get; }
```